{
  "activation_type": "swiglu",
  "alibi": false,
  "alibi_bias_max": 8.0,
  "architectures": [
    "OLMoForSequenceCLS"
  ],
  "attention_dropout": 0.0,
  "attention_layer_norm": false,
  "attention_layer_norm_with_affine": false,
  "auto_map": {
    "AutoConfig": "configuration_olmo.OLMoConfig",
    "AutoModelForCausalLM": "modeling_olmo.OLMoForCausalLM",
    "AutoModelForSequenceClassification": "modeling_olmo.OLMoForSequenceCLS"
  },
  "bias_for_layer_norm": false,
  "block_group_size": 1,
  "block_type": "sequential",
  "clip_qkv": null,
  "d_model": 768,
  "dtype": "float32",
  "emb_init_std": null,
  "embedding_dropout": 0.0,
  "embedding_layer_norm": false,
  "embedding_size": 4096,
  "eos_token_id": 3,
  "flash_attention": false,
  "include_bias": false,
  "init_cutoff_factor": null,
  "init_device": "meta",
  "init_fn": "mitchell",
  "init_std": 0.02,
  "layer_norm_eps": 1e-05,
  "layer_norm_type": "default",
  "layer_norm_with_affine": false,
  "max_sequence_length": 250,
  "mlp_hidden_size": null,
  "mlp_ratio": 8,
  "model_type": "olmo-gfm",
  "multi_query_attention": false,
  "n_heads": 12,
  "n_kv_heads": null,
  "n_layers": 12,
  "norm_after": false,
  "pad_token_id": 3,
  "precision": "amp_bf16",
  "problem_type": "single_label_classification",
  "residual_dropout": 0.0,
  "rope": true,
  "rope_full_precision": true,
  "rope_theta": 10000,
  "scale_emb_init": false,
  "scale_logits": false,
  "transformers_version": "4.57.3",
  "use_cache": true,
  "vocab_size": 4096,
  "weight_tying": true
}
